# useful shortcuts
alias h   "history"
alias cud "current_design"
alias rad "remove_design -all"

# increase significant digits in report files
set report_default_significant_digits  6

# set target library to GF22
set GF22_DIR "/usr/pack/gf-22-kgf/invecas/std/2020.01/"
set DB_LOC "model/timing/db/"

set CORNER "SSG_0P72V_0P00V_0P00V_0P00V_M40C"

set DB_LIBS ""
set ALIB_PATHS ""

lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_BASE_CSC20L_FDK_RELV06R40/${DB_LOC}GF22FDX_SC8T_104CPP_BASE_CSC20L_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_BASE_CSC20SL_FDK_RELV06R40/${DB_LOC}GF22FDX_SC8T_104CPP_BASE_CSC20SL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_BASE_CSC24L_FDK_RELV06R40/${DB_LOC}GF22FDX_SC8T_104CPP_BASE_CSC24L_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_BASE_CSC24SL_FDK_RELV06R40/${DB_LOC}GF22FDX_SC8T_104CPP_BASE_CSC24SL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_BASE_CSC28L_FDK_RELV06R40/${DB_LOC}GF22FDX_SC8T_104CPP_BASE_CSC28L_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_BASE_CSC28SL_FDK_RELV06R40/${DB_LOC}GF22FDX_SC8T_104CPP_BASE_CSC28SL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_ECO_CSL_FDK_RELV04R30/${DB_LOC}GF22FDX_SC8T_104CPP_ECO_CSL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_ECO_CSSL_FDK_RELV04R30/${DB_LOC}GF22FDX_SC8T_104CPP_ECO_CSSL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_HPK_CSL_FDK_RELV03R40/${DB_LOC}GF22FDX_SC8T_104CPP_HPK_CSL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_HPK_CSSL_FDK_RELV03R40/${DB_LOC}GF22FDX_SC8T_104CPP_HPK_CSSL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_HPKCUSTOM_CSL_FDK_RELV00R50/${DB_LOC}GF22FDX_SC8T_104CPP_HPKCUSTOM_CSL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_LPK_CSL_FDK_RELV03R30/${DB_LOC}GF22FDX_SC8T_104CPP_LPK_CSL_${CORNER}.db"
lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_LPK_CSSL_FDK_RELV03R30/${DB_LOC}GF22FDX_SC8T_104CPP_LPK_CSSL_${CORNER}.db"
#lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_SHIFT_CSL_FDK_RELV03R40/${DB_LOC}GF22FDX_SC8T_104CPP_SHIFT_CSL_${CORNER}.db"
#lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_SHIFT_CSSL_FDK_RELV03R40/${DB_LOC}GF22FDX_SC8T_104CPP_SHIFT_CSSL_${CORNER}.db"
#lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_SHIFTHL_CSL_FDK_RELV01R40/${DB_LOC}GF22FDX_SC8T_104CPP_SHIFTHL_CSL_${CORNER}.db"
#lappend DB_LIBS "${GF22_DIR}GF22FDX_SC8T_104CPP_SHIFTHL_CSSL_FDK_RELV01R40/${DB_LOC}GF22FDX_SC8T_104CPP_SHIFTHL_CSSL_${CORNER}.db"

set link_library [set target_library [concat ${DB_LIBS}  [list dw_foundation.sldb]]]
set alib_library_analysis_path ./alib/
set target_library ${DB_LIBS}

read_verilog ../synopsys/out/snitch_cluster_netlist.v
link_design -verbose snitch_cluster_synth_fixture

create_clock clk_i -period 1000
update_timing
set power_enable_analysis true
#set power_analysis_mode time_based


#update_power
#report_power
