set_attr init_hdl_search_path {/home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/include /home/tbenz/git/bslk/aegis/test/snitch/src/axi/include}
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_pma_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi_dma/src/axi_dma_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/riscv_instr.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_axi_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_cfg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/tcdm_interconnect_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_pkg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/reqrsp_interface/reqrsp_intf.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_fpu_sequencer.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_regfile_ff.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_cc.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_sdma_cluster.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_hive.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/tcdm_shim.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_lsu.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_fp_ss.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_fpu.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_shared_muldiv.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_demux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_addr_demux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_ssr_addr_gen.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_ssr_streamer.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_ssr_switch.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_axi_adapter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/serial/snitch_serial_link.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_cluster_peripheral.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/addr_decode.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/deprecated/fifo_v1.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/deprecated/fifo_v2.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/fifo_v3.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/id_queue.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/spill_register.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/isochronous_spill_register.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/isochronous_4phase_handshake.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/stream_arbiter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/onehot_to_bin.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/stream_addr_demux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/stream_demux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/stream_delay.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/stream_register.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/lzc.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/rstgen.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/popcount.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/rstgen_bypass.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/deprecated/rrarbiter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/deprecated/prioarbiter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/rr_arb_tree.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/stream_arbiter_flushable.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/lfsr.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/lfsr_8bit.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/lfsr_16bit.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/delta_counter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/counter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/cdc_2phase.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/reqrsp_interface/axi_to_reqrsp.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/reqrsp_interface/peripherals_to_reqrsp.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/reqrsp_interface/reqrsp_to_axi.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/reqrsp_interface/reqrsp_to_tcdm.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_l0.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_handler.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_lfsr.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_lookup.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_prefetch.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_icache/snitch_icache_refill.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/addr_dec_resp_mux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/amo_shim.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/bfly_net.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/clos_net.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/tcdm_interconnect.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/cluster_interconnect/rtl/tcdm_interconnect/xbar.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_tcdm_mux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/snitch_dma_addr_decoder.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_cast_multi.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_classifier.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_divsqrt_multi.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_fma.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_fma_multi.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_noncomp.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_opgroup_block.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_opgroup_fmt_slice.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_opgroup_multifmt_slice.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_rounding.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/fpnew/src/fpnew_top.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_atop_filter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_burst_splitter.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_cut.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_delayer.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_id_remap.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_intf.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_join.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_lite_join.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_lite_to_axi.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_lite_xbar.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_modify_address.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_multicut.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_to_axi_lite.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/dma/axi_dma_data_path.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/dma/axi_dma_data_mover.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/dma/axi_dma_burst_reshaper.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/dma/axi_dma_backend.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_demux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_mux.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_err_slv.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_id_prepend.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi/src/axi_xbar.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/register_interface/src/reg_intf.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/register_interface/src/axi_to_reg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/register_interface/src/axi_lite_to_reg.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/common_cells/src/sram.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/tech_cells_generic/src/rtl/tc_clk.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi_dma/src/axi_dma_twod_ext.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi_dma/src/axi_dma_perf_counters.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi_dma/src/frontend/axi_dma_tc_snitch_fe_id_gen.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/src/axi_dma/src/frontend/axi_dma_tc_snitch_fe.sv
read_hdl -sv /home/tbenz/git/bslk/aegis/test/snitch/test/cluster/snitch_cluster_synth_fixture.sv

read_hdl -sv ../mems/src/snitch_cluster.tc_sram.sv

read_libs /usr/pack/gf-22-kgf/invecas/std/2020.01/GF22FDX_SC8T_104CPP_BASE_CSC20L_FDK_RELV06R40/model/timing/lib/GF22FDX_SC8T_104CPP_BASE_CSC20L_TT_0P80V_0P00V_0P00V_0P00V_25C.lib.gz ../mems/out/model/timing/lib/IN22FDX_R1PH_NFHN_W00064B025M04C256_104cpp_SSG_0P720V_0P000V_0P000V_M40C.lib ../mems/out/model/timing/lib/IN22FDX_R1PH_NFHN_W00064B128M02C256_104cpp_SSG_0P720V_0P000V_0P000V_M40C.lib ../mems/out/model/timing/lib/IN22FDX_R1PH_NFHN_W01024B064M04C256_104cpp_SSG_0P720V_0P000V_0P000V_M40C.lib

elaborate snitch_cluster_synth_fixture
check_design -unresolved
power_map -effort express

return

#power_hdl -run elaborate snitch_cluster_synth_fixture
#power_hdl -run syn_generic

define_clock -period 1000 [get_pins */clk_i]
gen_clock_tree [get_pins */clk_i]

read_stimulus -file ../../../snitch-hero/snitch/test_full.saif -format saif -annotation_reporting_style new -debug -dut_instance tb_binary/fix/dut

compute_power

report_power

